Repository: tariqmiz31/silvariumsocial
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Post retrieved successfully
ar: تم استرداد المنشور بنجاح

source: Failed to fetch posts
ar: فشل في جلب المنشورات

source: Post created successfully
ar: تم إنشاء المنشور بنجاح

source: Failed to create post
ar: فشل في إنشاء المنشور

source: Content repurposed successfully
ar: تم إعادة صياغة المحتوى بنجاح

source: Failed to repurpose content
ar: فشل في إعادة صياغة المحتوى

source: Caption generated successfully
ar: تم إنشاء التعليق بنجاح

source: Failed to generate caption
ar: فشل في إنشاء التعليق

source: Performance prediction completed successfully
ar: تم إكمال توقع الأداء بنجاح

source: Failed to predict performance
ar: فشل في توقع الأداء

source: A/B test suggestions generated successfully
ar: تم إنشاء اقتراحات اختبار A/B بنجاح

source: Failed to generate A/B test suggestions
ar: فشل في إنشاء اقتراحات اختبار A/B
