{
  "en": {
    "brand_sub": "Brand & Compliance Portal",
    "home_title": "Silvarium Social",
    "home_tagline": "Professional Social Media Publishing Platform",
    "home_desc": "Silvarium Social is an internal platform developed exclusively for Silvarium Establishment to manage and publish content across supported social media platforms. Access is restricted to authorized users only.",
    "home_cta_app": "Open Application",
    "home_cta_docs": "Policies & Compliance",
    "home_panel1_title": "For platform reviewers",
    "home_panel1_p": "This domain is used for brand identification and compliance purposes. It provides access to public policies, data deletion instructions, and support contact for review and compliance verification.",
    "home_panel2_title": "Restricted access",
    "home_panel2_p": "The publishing application is available only to authorized users. Authentication is required to access internal features and connected social accounts.",
    "home_panel3_title": "Company ownership",
    "home_panel3_p": "Silvarium Social is owned and operated by Silvarium Establishment (a registered sole proprietorship). Silvarium is a registered trade name. All rights reserved.",
    "home_panel4_title": "Compliance links",
    "home_panel4_list1": "Terms of Service",
    "home_panel4_list2": "Privacy Policy",
    "home_panel4_list3": "Data Deletion",
    "home_panel4_list4": "Contact Support",
    "home_panel4_list5": "System Status",
    "footer_rights": "© Silvarium Social. All rights reserved. Owned and operated by Silvarium Establishment.",
    "nav_terms": "Terms",
    "nav_privacy": "Privacy",
    "nav_deletion": "Data Deletion",
    "nav_contact": "Contact",
    "nav_status": "System Status",
    "terms_title": "Terms of Service",
    "terms_intro": "These Terms govern access to and use of Silvarium Social, a service owned and operated by Silvarium Establishment. This service is intended for internal and authorized use only.",
    "terms_scope_h": "1. Scope and eligibility",
    "terms_scope_p": "Access to the application is restricted to authorized users. Accounts are issued by Silvarium Establishment and may be revoked at any time.",
    "terms_use_h": "2. Acceptable use",
    "terms_use_p": "Users must publish lawful content and comply with the policies of the social platforms they use (e.g., Meta, TikTok, Snapchat, LinkedIn). Users are responsible for content accuracy, rights, and permissions.",
    "terms_data_h": "3. Platform connections",
    "terms_data_p": "To enable publishing, the system may store platform access credentials (such as tokens) and associated account identifiers. Credentials are used only to perform authorized actions on connected platforms.",
    "terms_security_h": "4. Security",
    "terms_security_p": "Users must keep their login methods confidential and report any suspected unauthorized access. Silvarium Establishment may suspend access to protect security and integrity.",
    "terms_warranty_h": "5. Disclaimer",
    "terms_warranty_p": "The service is provided “as is” without warranties. Silvarium Establishment is not responsible for platform outages, API limitations, or content moderation decisions made by external platforms.",
    "terms_changes_h": "6. Changes",
    "terms_changes_p": "Silvarium Establishment may update these Terms as needed. Continued use indicates acceptance of the updated Terms.",
    "terms_contact_h": "7. Contact",
    "terms_contact_p": "For compliance or support inquiries, contact us at support@silvariumsocial.com or call +966575569677.",
    "privacy_title": "Privacy Policy",
    "privacy_intro": "This Privacy Policy describes how Silvarium Social collects and uses information for operating an internal publishing platform. Access is restricted to authorized users.",
    "privacy_collect_h": "1. Information we collect",
    "privacy_collect_p": "We may collect: user email address for authentication; platform access tokens and identifiers (e.g., page/account IDs) required for publishing; audit metadata such as connection timestamps and publishing status.",
    "privacy_use_h": "2. How we use information",
    "privacy_use_p": "We use information to authenticate users, connect social accounts, publish/schedule content on supported platforms, and maintain service security and auditability.",
    "privacy_share_h": "3. Sharing and disclosure",
    "privacy_share_p": "We do not sell user data. We share information only as necessary to interact with supported social platforms (via their APIs) or to comply with legal obligations.",
    "privacy_store_h": "4. Storage and retention",
    "privacy_store_p": "Data is stored securely and retained only as long as needed to operate the service or as required for security/audit purposes. Access to data is limited to authorized personnel.",
    "privacy_security_h": "5. Security",
    "privacy_security_p": "We apply reasonable technical and organizational measures to protect stored data. No system can be guaranteed 100% secure.",
    "privacy_rights_h": "6. Your choices",
    "privacy_rights_p": "Authorized users may request access, correction, or deletion of their account data. See the Data Deletion page for instructions.",
    "privacy_APIs_h": "7. APIs",
    "privacy_APIs_p": "We use official APIs provided by Meta, Google (YouTube), Snapchat, and other platforms.We do not use automation, scraping, or unofficial tools."
    "privacy_contact_h": "8. Contact",
    "privacy_contact_p": "For privacy-related inquiries, contact us at support@silvariumsocial.com or call +966575569677.",
    "deletion_title": "Data Deletion",
    "deletion_intro": "Silvarium Social provides a clear process for data deletion requests for authorized users.",
    "deletion_how_h": "How to request deletion",
    "deletion_how_p": "Send a deletion request from your authorized email address to support@silvariumsocial.com. Include your email address and the platform connections you want removed (if applicable).",
    "deletion_process_h": "What we delete",
    "deletion_process_p": "Upon verification, we permanently delete stored personal identifiers (such as email), connected platform credentials (tokens), and related connection metadata from our systems.",
    "deletion_timeline_h": "Timeline",
    "deletion_timeline_p": "Deletion requests are processed within a reasonable timeframe after verification. Some audit logs may be retained where required for security or legal compliance.",
    "deletion_contact_h": "Contact",
    "deletion_contact_p": "Submit requests to: support@silvariumsocial.com (Phone: +966575569677).",
    "contact_title": "Contact & Support",
    "contact_intro": "For support, compliance, or platform review inquiries, contact us at support@silvariumsocial.com or call +966575569677.",
    "contact_hours_h": "Response",
    "contact_hours_p": "We respond as soon as possible during business hours. For platform reviewer inquiries, include the name of the platform and your review reference (if available).",
    "status_title": "System Status",
    "status_intro": "This page provides a simple public status for Silvarium Social services.",
    "status_current_h": "Current status",
    "status_current_ok": "All systems operational.",
    "status_components_h": "Components",
    "status_comp1": "Application (app.silvariumsocial.com)",
    "status_comp2": "OAuth Connections (supported platforms)",
    "status_comp3": "Publishing & Scheduling Services",
    "status_note_h": "Notes",
    "status_note_p": "If you experience an issue, contact Support at support@silvariumsocial.com or call +966575569677 and include the time, your authorized email, and the affected platform.",
    "terms_updated": "Last updated: February 2026",
    "privacy_updated": "Last updated: February 2026",
    "deletion_updated": "Last updated: February 2026"
  },
  "ar": {
    "brand_sub": "بوابة العلامة التجارية والامتثال",
    "home_title": "سيلفاريوم سوشال",
    "home_tagline": "منصة احترافية لإدارة ونشر المحتوى عبر منصات التواصل",
    "home_desc": "سيلفاريوم سوشال منصة داخلية مطوّرة خصيصًا لمؤسسة سيلفاريوم لإدارة ونشر المحتوى عبر منصات التواصل المدعومة، ويقتصر استخدامها على المستخدمين المصرّح لهم فقط.",
    "home_cta_app": "الدخول إلى التطبيق",
    "home_cta_docs": "السياسات والامتثال",
    "home_panel1_title": "لِمراجعي منصات التواصل",
    "home_panel1_p": "هذا النطاق مخصص لتعريف العلامة التجارية ومتطلبات الامتثال. ستجد هنا سياسة الاستخدام والخصوصية وصفحة حذف البيانات وطرق التواصل لدعم المراجعة والتحقق.",
    "home_panel2_title": "وصول مقيّد",
    "home_panel2_p": "تطبيق النشر متاح للمستخدمين المخولين فقط. يلزم تسجيل الدخول للوصول للخصائص الداخلية والحسابات المرتبطة.",
    "home_panel3_title": "ملكية وتشغيل",
    "home_panel3_p": "سيلفاريوم سوشال مملوك ومدار بواسطة مؤسسة سيلفاريوم. سيلفاريوم اسم تجاري مسجّل. جميع الحقوق محفوظة.",
    "home_panel4_title": "روابط الامتثال",
    "home_panel4_list1": "الشروط والأحكام",
    "home_panel4_list2": "سياسة الخصوصية",
    "home_panel4_list3": "حذف البيانات",
    "home_panel4_list4": "تواصل مع الدعم",
    "home_panel4_list5": "حالة النظام",
    "footer_rights": "© سيلفاريوم سوشال. جميع الحقوق محفوظة. تملكها وتديرها مؤسسة سيلفاريوم.",
    "nav_terms": "الشروط",
    "nav_privacy": "الخصوصية",
    "nav_deletion": "حذف البيانات",
    "nav_contact": "الدعم",
    "nav_status": "حالة النظام",
    "terms_title": "الشروط والأحكام",
    "terms_intro": "تنظّم هذه الشروط الوصول إلى واستخدام سيلفاريوم سوشال، وهي خدمة مملوكة ومدارة من قبل مؤسسة سيلفاريوم. هذه الخدمة مخصصة للاستخدام الداخلي ومحصورة بالمستخدمين المصرّح لهم فقط.",
    "terms_scope_h": "1. نطاق الخدمة والأهلية",
    "terms_scope_p": "الوصول إلى التطبيق محصور بالمستخدمين المخوّلين. يتم إصدار الحسابات بواسطة مؤسسة سيلفاريوم ويحق لنا إيقافها أو سحبها في أي وقت.",
    "terms_use_h": "2. الاستخدام المقبول",
    "terms_use_p": "يلتزم المستخدم بنشر محتوى نظامي والامتثال لسياسات منصات التواصل التي يستخدمها (مثل ميتا، تيك توك، سناب شات، لينكدإن). المستخدم مسؤول عن دقة المحتوى والحقوق والتراخيص.",
    "terms_data_h": "3. ربط الحسابات بالمنصات",
    "terms_data_p": "لتفعيل النشر، قد نقوم بتخزين بيانات الربط اللازمة مثل رموز الوصول (Tokens) ومعرّفات الحسابات/الصفحات. تُستخدم هذه البيانات فقط لتنفيذ إجراءات مصرح بها على المنصات المرتبطة.",
    "terms_security_h": "4. الأمان",
    "terms_security_p": "يلتزم المستخدم بالحفاظ على سرية بيانات الدخول والإبلاغ عن أي اشتباه في استخدام غير مصرح به. قد يتم تعليق الوصول لحماية أمن النظام وسلامته.",
    "terms_warranty_h": "5. إخلاء المسؤولية",
    "terms_warranty_p": "تُقدّم الخدمة كما هي دون ضمانات. لا تتحمل مؤسسة سيلفاريوم مسؤولية انقطاعات المنصات الخارجية أو قيود واجهاتها البرمجية أو قرارات المراجعة/الإشراف الخاصة بها.",
    "terms_changes_h": "6. التحديثات",
    "terms_changes_p": "قد تقوم مؤسسة سيلفاريوم بتحديث هذه الشروط عند الحاجة. استمرار استخدام الخدمة يُعد قبولاً للتحديثات.",
    "terms_contact_h": "7. التواصل",
    "terms_contact_p": "للاستفسارات المتعلقة بالامتثال أو الدعم تواصل معنا عبر: support@silvariumsocial.com أو عبر الهاتف: 0575569677.",
    "privacy_title": "سياسة الخصوصية",
    "privacy_intro": "توضح هذه السياسة كيفية جمع واستخدام المعلومات لتشغيل منصة نشر داخلية. الوصول محصور بالمستخدمين المصرّح لهم فقط.",
    "privacy_collect_h": "1. المعلومات التي نجمعها",
    "privacy_collect_p": "قد نجمع: البريد الإلكتروني لغرض تسجيل الدخول؛ رموز الوصول ومعرّفات الحسابات اللازمة للنشر (مثل رقم الصفحة/الحساب)؛ وبيانات تشغيلية مثل وقت الربط وحالة النشر/الجدولة.",
    "privacy_use_h": "2. كيفية استخدام المعلومات",
    "privacy_use_p": "نستخدم المعلومات للتحقق من المستخدمين، وربط الحسابات، ونشر/جدولة المحتوى على المنصات المدعومة، والحفاظ على الأمان وسجل التدقيق.",
    "privacy_share_h": "3. المشاركة والإفصاح",
    "privacy_share_p": "لا نبيع بيانات المستخدمين. نشارك البيانات فقط بالقدر اللازم للتعامل مع منصات التواصل عبر واجهاتها البرمجية أو للامتثال للمتطلبات النظامية.",
    "privacy_store_h": "4. التخزين والاحتفاظ",
    "privacy_store_p": "تُخزّن البيانات بشكل آمن وتُحتفظ فقط للمدة اللازمة لتشغيل الخدمة أو لأغراض الأمان/التدقيق. الوصول للبيانات محدود على الأشخاص المصرح لهم.",
    "privacy_security_h": "5. الأمان",
    "privacy_security_p": "نطبق إجراءات تقنية وتنظيمية معقولة لحماية البيانات. لا يوجد نظام مضمون 100%.",
    "privacy_rights_h": "6. خيارات المستخدم",
    "privacy_rights_p": "يمكن للمستخدمين المخوّلين طلب الوصول أو التصحيح أو حذف بيانات حسابهم. راجع صفحة حذف البيانات للطريقة.",
    "privacy_APIs_h": "7. واجهات برمجة التطبيقات",
    "privacy_APIs_p": "نستخدم فقط واجهات البرمجة الرسمية (APIs) المقدّمة من منصات مثل Meta، وGoogle (YouTube)، وSnapchat، وغيرها من المنصات المعتمدة.ولا نستخدم أي أدوات آلية غير رسمية، أو تقنيات جمع بيانات (Scraping)، أو وسائل مخالفة لسياسات هذه المنصات."
    "privacy_contact_h": "8. التواصل",
    "privacy_contact_p": "للاستفسارات المتعلقة بالخصوصية تواصل معنا عبر: support@silvariumsocial.com أو عبر الهاتف: 0575569677.",
    "deletion_title": "حذف البيانات",
    "deletion_intro": "يوفر سيلفاريوم سوشال آلية واضحة لطلبات حذف البيانات للمستخدمين المخولين.",
    "deletion_how_h": "طريقة طلب الحذف",
    "deletion_how_p": "أرسل طلب حذف من بريدك المخوّل إلى support@silvariumsocial.com، مع ذكر بريدك الإلكتروني والمنصات التي ترغب بإزالة ربطها (إن وجدت).",
    "deletion_process_h": "ماذا نحذف",
    "deletion_process_p": "بعد التحقق، نقوم بحذف البيانات التعريفية (مثل البريد)، وبيانات الربط بالمنصات (Tokens)، وبيانات الربط ذات الصلة من أنظمتنا بشكل نهائي.",
    "deletion_timeline_h": "المدة الزمنية",
    "deletion_timeline_p": "تتم معالجة طلبات الحذف خلال مدة معقولة بعد التحقق. قد يتم الاحتفاظ ببعض سجلات التدقيق إذا تطلب ذلك الأمان أو المتطلبات النظامية.",
    "deletion_contact_h": "التواصل",
    "deletion_contact_p": "أرسل الطلب إلى: support@silvariumsocial.com (هاتف: 0575569677).",
    "contact_title": "التواصل والدعم",
    "contact_intro": "للدعم أو الاستفسارات المتعلقة بالامتثال أو مراجعة المنصات، تواصل معنا عبر: support@silvariumsocial.com أو عبر الهاتف: 0575569677.",
    "contact_hours_h": "الاستجابة",
    "contact_hours_p": "نرد في أقرب وقت ممكن خلال ساعات العمل. لمراجعي المنصات: يُفضّل ذكر اسم المنصة ورقم المرجع إن وُجد.",
    "status_title": "حالة النظام",
    "status_intro": "هذه الصفحة تعرض حالة خدمات سيلفاريوم سوشال بشكل مبسط.",
    "status_current_h": "الحالة الحالية",
    "status_current_ok": "جميع الأنظمة تعمل بشكل طبيعي.",
    "status_components_h": "المكونات",
    "status_comp1": "التطبيق (app.silvariumsocial.com)",
    "status_comp2": "خدمات الربط (المنصات المدعومة)",
    "status_comp3": "خدمات النشر والجدولة",
    "status_note_h": "ملاحظات",
    "status_note_p": "عند وجود مشكلة، تواصل مع الدعم عبر support@silvariumsocial.com أو عبر الهاتف 0575569677 مع ذكر الوقت والبريد المخوّل والمنصة المتأثرة.",
    "terms_updated": "آخر تحديث: فبراير 2026",
    "privacy_updated": "آخر تحديث: فبراير 2026",
    "deletion_updated": "آخر تحديث: فبراير 2026"
  }
}
